templates/playwright/test-data/soap/NumberConversion.ts.ejs

export const numberConversionSoapData = {
  numberToWords: {
    url: 'https://www.dataaccess.com/webservicesserver/NumberConversion.wso',
    headers: {
      'Content-Type': 'text/xml; charset=utf-8',
    },
    soapAction: 'https://www.dataaccess.com/webservicesserver/NumberConversion.wso/NumberToWords',
    body: `
<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Body>
    <NumberToWords xmlns="http://www.dataaccess.com/webservicesserver/">
      <ubiNum>125</ubiNum>
    </NumberToWords>
  </soap:Body>
</soap:Envelope>
`.trimStart(),
    responsePath: 'Envelope.Body.NumberToWordsResponse.NumberToWordsResult',
  },
  numberToDollars: {
    url: 'https://www.dataaccess.com/webservicesserver/NumberConversion.wso',
    headers: {
      'Content-Type': 'text/xml; charset=utf-8',
    },
    soapAction: 'https://www.dataaccess.com/webservicesserver/NumberConversion.wso/NumberToDollars',
    body: `
<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Body>
    <NumberToDollars xmlns="http://www.dataaccess.com/webservicesserver/">
      <dNum>12.50</dNum>
    </NumberToDollars>
  </soap:Body>
</soap:Envelope>
`.trimStart(),
    responsePath: 'Envelope.Body.NumberToDollarsResponse.NumberToDollarsResult',
  },
};
